# CLI tools
brew "git"
brew "zsh"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "jq"
brew "neovim"
brew "lua-language-server"
brew "tmux"
brew "uv"
brew "htop"
brew "nvtop"
brew "zsh-vi-mode"

# Fonts (for terminal and editor)
cask "font-jetbrains-mono-nerd-font"

# GUI apps
cask "kitty"
cask "google-chrome"

# Window manager
cask "nikitabobko/tap/aerospace"
